/********************************************************************************

   file: diom_config.c

   Description: This file contains all the routines needed to query and configure
                the ADAM Digital Input/Output (DIO) control module. The query 
                command interrogates the network and reports all DIO modules
                detected on the network. The configure command configures the
                network parameters of the DIO module according to the IP
                address or channel number entered by the user.

 *********************************************************************************/


/* 
 * RCS info
 * $Author: ccalvert $
 * $Locker:  $
 * $Date: 2012/01/24 16:21:24 $
 * $Id: diom_config.c,v 1.1 2012/01/24 16:21:24 ccalvert Exp $
 * $Revision: 1.1 $
 * $State: Exp $
 */  

#include <fcntl.h>
#include <stdio.h>
#include <curses.h>
#include <errno.h>
#include <stdlib.h>
#include <strings.h>
#include <unistd.h>
#include <sys/types.h>
#include <sys/socket.h>
#include <sys/un.h>
#include <stropts.h>
#include <arpa/inet.h>
#include <netinet/tcp.h>
#include <netdb.h>
#include <netinet/in.h>
#include <arpa/inet.h>


#ifdef SUNOS
#include <sys/sockio.h>
#endif

#ifdef LINUX
#include <string.h>
#endif


#define MAX_BUFFER_SIZE       5000
#define MAX_RETRIES             10

   /* DIO module message header macros */

#define DIO_MODULE_PORT_NUM     5048
#define HEADER                "MADA"
#define MSG_VERSION           0x0100


   /* DIO module queries */

#define DEVICE_INFORMATION_QUERY  0x0000
#define NETWORK_CONFIG_QUERY      0x0010
#define PORT_CONFIG_QUERY         0x0020

   /* DIO module commands */

#define DEVICE_CONFIG_SETUP       0x4000
#define NETWORK_CONFIG_SETUP      0x4010
#define RESET_SYSTEM_SETUP        0x40f0


#define uchar unsigned char


   /* file scope variables */

typedef struct {
   char  header [4];
   int   msg_id;
   short msg_version;
   short device_type;
   int   nodeid_high;   /* high mac address  */
   int   nodeid_low;    /* low mac address   */
   uchar user_id [32];
   ushort command;
   short data_len;
} msg_header_t; 

  
typedef struct {
   short firmware_version_major;
   short firmware_version_minor;
   short hardware_version;
   short port_number;
   uchar mac_address [6];
   short reserved;
   int   device_name_len;
   int   device_name_offset;
   int   device_description_len;
   int   device_description_offset;
   char  device_name [64];
   char  device_description [128];
}   device_query_response_t;

typedef struct {
   msg_header_t msg_header;
   short ethernet_speed_flag;
   short ethernet_mode_flag;
   int   network_config_protocol_flag;
   short ethernet_speed;
   short ethernet_mode;
   uchar mac_address[6];
   short reserved;
   int   network_config_protocol;
   u_char ip_address[4];
   int    subnet_mask;
   int    default_gateway_ip_addr;
}   network_query_response_t;

typedef struct {
   short next_port;
   short port_id;
   short port_type_flag;    /* 0x0001 - RS-232
                               0x0002 - RS-485
                               0x0004 - RS-422 */
   short data_bits_flag;    /* 0x0001 - 4 data bits
                               0x0002 - 5 data bits
                               0x0004 - 6 data bits
                               0x0008 - 7 data bits
                               0x0010 - 8 data bits */
   short parity_flag;       /* 0x0001 - no parity
                               0x0002 - odd parity
                               0x0004 - even parity
                               0x0008 - mark parity
                               0x0010 - space parity */
   short stop_bits_flag;    /* 0x0001 - 1 stop bit
                               0x0002 - 1.5 sopt bits
                               0x0004 - 2 stop bits */
   short flow_control_flag; /* 0x0001 - no flow control
                               0x0002 - Xon/Xoff flow control
                               0x0004 - RTS/CTS flow control
                               0x0008 - DTR/DSR flow control */
   short port_type;         /* 0x0001 - RS-232
                               0x0002 - RS-485
                               0x0004 - RS-422 */
   short data_bits;         /* 0x0001 - 4 data bits
                               0x0002 - 5 data bits
                               0x0004 - 6 data bits
                               0x0008 - 7 data bits
                               0x0010 - 8 data bits */
   short parity;            /* 0x0001 - no parity
                               0x0002 - odd parity
                               0x0004 - even parity
                               0x0008 - mark parity
                               0x0010 - space parity */
   short stop_bits;         /* 0x0001 - 1 stop bit
                               0x0002 - 1.5 sopt bits
                               0x0004 - 2 stop bits */
   short flow_control;      /* 0x0001 - no flow control
                               0x0002 - Xon/Xoff flow control
                               0x0004 - RTS/CTS flow control
                               0x0008 - DTR/DSR flow control */
   short port_state;        /* 0x0001 - port enabled
                               0x0100 - port disabled */
   short reserved_1;
   int max_baud_rate;       /* 0x00038400 */
   int min_baud_rate;       /* 0x00000032 */
   int baud_rate;
   int reserved_2;
   int port_name_len;
   char port_name [512];    /* size defined by port_name_len */
}   port_query_response_t;


typedef struct {
   ushort ethernet_speed;
   ushort ethernet_mode;
   uchar  mac_address[6];
   ushort spare;
   int    network_config_protocol;
   uint   ip_address; 
   uint   subnet_mask;
   uint   default_gateway;
} network_config_cmd_t;

typedef struct {
   uchar mac_address[6];
   uchar ip_address [INET_ADDRSTRLEN];
   uint  subnet_mask;
   uint  default_gateway;
} device_info_t;

static int    Sd;               /* socket descriptor */
static struct sockaddr_in Sin;  /* socket address structure */
static int    Last_cmd_sent;
static int    Query_network;    /* flag to query network for DIO modules */
